In [2]:
!pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.9.1-cp37-cp37m-win_amd64.whl (1.1 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.1

In [3]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.types import Integer, Text, String, DateTime, Float
import psycopg2

In [4]:
df = pd.read_csv('mortgage.csv') #read in csv

In [5]:
df.head()

   mortgage_id       mortgage_name  mortgage_rate
0            1  10-Year Fixed Loan          0.030
1            2  15-Year Fixed Loan          0.035
2            3  20-Year Fixed Loan          0.040
3            4  30-Year Fixed Loan          0.045
4            5  40-Year Fixed Loan          0.050

In [6]:
db_name = 'mortgage_db'  #specify db
table_name = 'mortgage'  #specify table

In [10]:
#connect python to pgAdmin
connect_string ='postgresql://postgres:postgres@localhost:5432/{}'\
                .format(db_name)

sql_engine = create_engine(connect_string)

In [11]:
df.to_sql(name=table_name, con=sql_engine, 
         if_exists='replace', 
         index=False,
         dtype={'mortgage_id':Text, #create table schema
              'mortgage_name':Text, 
              'mortgage_rate':Float}
         )

In [13]:
query = 'select * from {}'.format(table_name)

pd.read_sql_query(query, sql_engine)

  mortgage_id       mortgage_name  mortgage_rate
0           1  10-Year Fixed Loan          0.030
1           2  15-Year Fixed Loan          0.035
2           3  20-Year Fixed Loan          0.040
3           4  30-Year Fixed Loan          0.045
4           5  40-Year Fixed Loan          0.050